{
  "status": "success",
  "totalResults": 22255,
  "results": [
    {
      "title": "Coronavirus India Live Updates: India records 3.49 lakh new Covid cases, 2,767 deaths - The Indian Express",
      "link": "https://news.google.com/__i/rss/rd/articles/CBMiW2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vYXJ0aWNsZS9pbmRpYS9jb3JvbmF2aXJ1cy1pbmRpYS1saXZlLXVwZGF0ZXMtc2Vjb25kLXdhdmUtNzI4ODAxNy_SAWBodHRwczovL2luZGlhbmV4cHJlc3MuY29tL2FydGljbGUvaW5kaWEvY29yb25hdmlydXMtaW5kaWEtbGl2ZS11cGRhdGVzLXNlY29uZC13YXZlLTcyODgwMTcvbGl0ZS8?oc=5",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Coronavirus India Live Updates: India records 3.49 lakh new Covid cases, 2,767 deaths  The Indian ExpressIndia's COVID woes worsen amid continued oxygen shortage  Al Jazeera EnglishCovid-19: Daily cases touch 3.5 lakh; 2,760 die in 24 hours  Times of IndiaBreathless in India: The price of inaction  The New Indian ExpressCovid-19: Is this a political turning point?  Hindustan TimesView Full coverage on Google News",
      "content": null,
      "pubDate": "2021-04-25 05:14:05",
      "image_url": null,
      "source_id": "google"
    },
    {
      "title": "Coronavirus latest news: Police injured in London anti-lockdown protest",
      "link": "https://www.telegraph.co.uk/global-health/science-and-disease/coronavirus-news-covid-pill-vaccine-india-blood-clots-cases/",
      "keywords": [
        "topics:in-the-news/uk-coronavirus-lockdown",
        "structure:news/world-news",
        "structure:news",
        "topics:things/vaccines",
        "structure:global-health-security",
        "structure:science-and-disease",
        "topics:in-the-news/coronavirus",
        "structure:news/uk-news",
        "storytype:standard"
      ],
      "creator": ["Global Health Security Team"],
      "video_url": null,
      "description": null,
      "content": null,
      "pubDate": "2021-04-25 05:13:32",
      "image_url": "https://www.telegraph.co.uk/content/dam/global-health/2021/04/25/TELEMMGLPICT000256827032_trans_NvBQzQNjv4BqM37qcIWR9CtrqmiMdQVx7Lz15pYf9gWQ0mJPVyrrflw.jpeg",
      "source_id": "telegraph"
    },
    {
      "title": "Antiseptic throat spray can reduce COVID-19 spread in high-risk settings, say Singapore researchers - CNA",
      "link": "https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LmNoYW5uZWxuZXdzYXNpYS5jb20vbmV3cy9zaW5nYXBvcmUvdGhyb2F0LXNwcmF5LXJlZHVjZS1jb3ZpZC0xOS1zcHJlYWQtaGlnaC1yaXNrLXNldHRpbmdzLXNpbmdhcG9yZS0xNDY4NjA4NtIBAA?oc=5",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Antiseptic throat spray can reduce COVID-19 spread in high-risk settings, say Singapore researchers  CNAThroat spray and hydroxychloroquine found to reduce risk of Covid-19 infection: S'pore study  The Straits TimesView Full coverage on Google News",
      "content": null,
      "pubDate": "2021-04-25 05:13:19",
      "image_url": null,
      "source_id": "google"
    },
    {
      "title": "Knights defeat Ducks for team-record ninth straight win",
      "link": "https://nationalpost.com/pmn/sports-pmn/knights-defeat-ducks-for-team-record-ninth-straight-win-2",
      "keywords": null,
      "creator": ["Reuters"],
      "video_url": null,
      "description": "Chandler Stephenson had two goals and an assist as the Vegas Golden Knights set a franchise record with their ninth consecutive victory, defeating the host Anaheim Ducks 5-1 Saturday night. William Carrier, William Karlsson and Shea Theodore also scored, and goaltender Robin Lehner made 23 saves for the Golden Knights (34-11-2, 70 points), who moved […]",
      "content": "Chandler Stephenson had two goals and an assist as the Vegas Golden Knights set a franchise record with their ninth consecutive victory, defeating the host Anaheim Ducks 5-1 Saturday night. Read More",
      "pubDate": "2021-04-25 05:12:50",
      "image_url": null,
      "source_id": "nationalpost"
    },
    {
      "title": "Alcon: Updated Medium-Term Plan Highlights The Growth And Margin Opportunity",
      "link": "https://seekingalpha.com/article/4421085-alcon-updated-medium-term-plan-growth-margin-opportunity?source=feed_sector_healthcare",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": null,
      "content": null,
      "pubDate": "2021-04-25 05:12:29",
      "image_url": null,
      "source_id": "seekingalpha"
    },
    {
      "title": "Holtby solid as Vancouver Canucks edge Ottawa Senators 4-2",
      "link": "https://lethbridgenewsnow.com/2021/04/24/holtby-solid-as-vancouver-canucks-edge-ottawa-senators-4-2/",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "VANCOUVER - Tanner Pearson scored the game winner Saturday as the Vancouver Canucks edged the Ottawa Senators 4-2. Nate Schmidt, Brock Boeser and J.T....",
      "content": "VANCOUVER — Tanner Pearson scored the game winner Saturday as the Vancouver Canucks edged the Ottawa Senators 4-2. Nate Schmidt, Brock Boeser and J.T. Miller also scored for the Canucks (19-19-3), and Bo Horvat notched a pair of assists. Evgenii Dadanov had a goal and an assist for the Sens (17-24-6), and Colin White also scored. It was a busy night in net for Ottawa. Matt Murray stopped 12-of-13 shots before leaving with an injury midway through the second period. Marcus Hogberg had 18 saves in relief. Braden Holtby put up another solid performance for Vancouver, stopping 26-of-28 shots, including a penalty attempt. Saturday’s result snapped a three-game win streak for Ottawa, who remain at the bottom of the all-Canadian North Division, three points behind the Canucks. Miller sealed the score at 4-2 Saturday, firing a shot into the empty net from the top of the crease with 54 seconds left on the clock. Pearson had already put away the game winner 13:45 into the third. Horvat streaked into the Sens’ end and slipped a pass to Pearson at the top of the slot. Pearson took a few strides, then ripped a shot over Hogberg’s stick. It was the left-winger’s ninth goal of the season. Dadanov had evened the score at 2-2 less than two minutes earlier, netting his 13th goal of the year with an unassisted blast that sailed over Holtby’s glove and in. The Canucks netminder was tested midway through the second when defenceman Tyler Myers was called for slashing Alex Formenton on a breakaway. The Sens left-winger was awarded a penalty shot but Holtby calmly tracked Formenton as he weaved in and turned the wrist shot away with his right pad. Ottawa made a change in net 4:27 into the middle frame Saturday after Murray and Vancouver’s Jake Virtanen got tangled up in the crease. The goalie got his stick caught in the legs of the Vancouver right-winger and hauled him down, prompting a tripping call. Murray also appeared to suffer an injury on the play and shook his leg before heading to the locker room. Sens coach D.J. Smith said earlier on Saturday that Anton Forsberg would start in net against the Canucks, with Murray acting as backup. But Forsberg suffered a lower-body injury in warmups and did not take the ice. Vancouver was quick to capitalize on Murray’s tripping penalty. Quinn Hughes sliced a crisp pass to Boeser and he rifled it in from the right faceoff dot, beating Hogberg stick side to give the Canucks a 2-1 lead 4:46 into the second period. Boeser leads the Canucks in scoring this season with 37 points (17 goals, 20 assists). Vancouver was 1 for 4 with the man advantage Saturday. The Canucks got two minutes of five-on-three hockey in the third after Artem Zub and Erik Brannstrom were called for a high stick and cross-checking, respectively. The home side recorded just one shot on goal during the ensuing power play. Ottawa failed to capitalize on five power plays, including a four-minute double minor Virtanen picked up midway through the second for a high stick that left Sens rookie Tim Stutzle with a bloody nose. The first period ended in a 1-1 draw after White put the Sens on the board 8:32 into the game. Connor Brown’s shot from near the blue line hit traffic in front of the crease, where White and Virtanen battled for the puck. It hit Virtanen’s skate and sailed in past Holtby, but White was credited with his ninth goal of the year. The Canucks opened the scoring early, forcing a turnover deep in Ottawa territory and getting the puck up to Schmidt. The defenceman unleashed a long blast from the point and scored his fourth of the year 1:43 into the first. Vancouver’s Jayce Hawryluk needed some minor medical attention in the first period after dropping the gloves with Brannstrom. The Ottawa defenceman had taken issue with Hawryluk squashing him along the end boards and the Canucks forward was quick to step up to the challenge. Each was handed a five-minute major for fighting and Hawryluk winced while he held a bag of ice to his hand in the penalty box. The two sides will meet again in Ottawa on Monday. NOTES: Defenceman Alex Edler returned to the Canucks’ lineup after serving a two-game suspension for a knee-on-knee hit on Toronto’s Zach Hyman. … Vancouver’s Zack MacEwen and Tyler Motte played their first games since March 24. This report by The Canadian Press was first published April 24, 2021. Gemma Karstens-Smith, The Canadian Press",
      "pubDate": "2021-04-25 05:11:45",
      "image_url": "https://s3.amazonaws.com/socast-superdesk/media/2021042505048/6084fa07023d16665e56cf0bjpeg.jpg",
      "source_id": "lethbridgenewsnow"
    },
    {
      "title": "Holtby solid as Vancouver Canucks edge Ottawa Senators 4-2",
      "link": "https://panow.com/2021/04/24/holtby-solid-as-vancouver-canucks-edge-ottawa-senators-4-2/",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "VANCOUVER - Tanner Pearson scored the game winner Saturday as the Vancouver Canucks edged the Ottawa Senators 4-2. Nate Schmidt, Brock Boeser and J.T....",
      "content": "VANCOUVER — Tanner Pearson scored the game winner Saturday as the Vancouver Canucks edged the Ottawa Senators 4-2. Nate Schmidt, Brock Boeser and J.T. Miller also scored for the Canucks (19-19-3), and Bo Horvat notched a pair of assists. Evgenii Dadanov had a goal and an assist for the Sens (17-24-6), and Colin White also scored. It was a busy night in net for Ottawa. Matt Murray stopped 12-of-13 shots before leaving with an injury midway through the second period. Marcus Hogberg had 18 saves in relief. Braden Holtby put up another solid performance for Vancouver, stopping 26-of-28 shots, including a penalty attempt. Saturday’s result snapped a three-game win streak for Ottawa, who remain at the bottom of the all-Canadian North Division, three points behind the Canucks. Miller sealed the score at 4-2 Saturday, firing a shot into the empty net from the top of the crease with 54 seconds left on the clock. Pearson had already put away the game winner 13:45 into the third. Horvat streaked into the Sens’ end and slipped a pass to Pearson at the top of the slot. Pearson took a few strides, then ripped a shot over Hogberg’s stick. It was the left-winger’s ninth goal of the season. Dadanov had evened the score at 2-2 less than two minutes earlier, netting his 13th goal of the year with an unassisted blast that sailed over Holtby’s glove and in. The Canucks netminder was tested midway through the second when defenceman Tyler Myers was called for slashing Alex Formenton on a breakaway. The Sens left-winger was awarded a penalty shot but Holtby calmly tracked Formenton as he weaved in and turned the wrist shot away with his right pad. Ottawa made a change in net 4:27 into the middle frame Saturday after Murray and Vancouver’s Jake Virtanen got tangled up in the crease. The goalie got his stick caught in the legs of the Vancouver right-winger and hauled him down, prompting a tripping call. Murray also appeared to suffer an injury on the play and shook his leg before heading to the locker room. Sens coach D.J. Smith said earlier on Saturday that Anton Forsberg would start in net against the Canucks, with Murray acting as backup. But Forsberg suffered a lower-body injury in warmups and did not take the ice. Vancouver was quick to capitalize on Murray’s tripping penalty. Quinn Hughes sliced a crisp pass to Boeser and he rifled it in from the right faceoff dot, beating Hogberg stick side to give the Canucks a 2-1 lead 4:46 into the second period. Boeser leads the Canucks in scoring this season with 37 points (17 goals, 20 assists). Vancouver was 1 for 4 with the man advantage Saturday. The Canucks got two minutes of five-on-three hockey in the third after Artem Zub and Erik Brannstrom were called for a high stick and cross-checking, respectively. The home side recorded just one shot on goal during the ensuing power play. Ottawa failed to capitalize on five power plays, including a four-minute double minor Virtanen picked up midway through the second for a high stick that left Sens rookie Tim Stutzle with a bloody nose. The first period ended in a 1-1 draw after White put the Sens on the board 8:32 into the game. Connor Brown’s shot from near the blue line hit traffic in front of the crease, where White and Virtanen battled for the puck. It hit Virtanen’s skate and sailed in past Holtby, but White was credited with his ninth goal of the year. The Canucks opened the scoring early, forcing a turnover deep in Ottawa territory and getting the puck up to Schmidt. The defenceman unleashed a long blast from the point and scored his fourth of the year 1:43 into the first. Vancouver’s Jayce Hawryluk needed some minor medical attention in the first period after dropping the gloves with Brannstrom. The Ottawa defenceman had taken issue with Hawryluk squashing him along the end boards and the Canucks forward was quick to step up to the challenge. Each was handed a five-minute major for fighting and Hawryluk winced while he held a bag of ice to his hand in the penalty box. The two sides will meet again in Ottawa on Monday. NOTES: Defenceman Alex Edler returned to the Canucks’ lineup after serving a two-game suspension for a knee-on-knee hit on Toronto’s Zach Hyman. … Vancouver’s Zack MacEwen and Tyler Motte played their first games since March 24. This report by The Canadian Press was first published April 24, 2021. Gemma Karstens-Smith, The Canadian Press",
      "pubDate": "2021-04-25 05:11:41",
      "image_url": "https://s3.amazonaws.com/socast-superdesk/media/2021042505048/6084fa07023d16665e56cf0bjpeg.jpg",
      "source_id": "panow"
    },
    {
      "title": "UFC 261: Anthony Smith lands one of the most brutal leg kick finishes ever as Jimmy Crute’s foot goes floppy",
      "link": "https://talksport.com/sport/mma/871229/ufc-261-anthony-smith-brutal-leg-kick-finishes-jimmy-crutes-foot-floppy/",
      "keywords": ["MMA", "Sport", "ufc"],
      "creator": ["Alex McCarthy"],
      "video_url": null,
      "description": "UFC 261’s main card got off to a wild start with Anthony Smith and Jimmy Crute. Crute is a young, surging light-heavyweight looking to break in at the top end of the division against Smith, a man that has become a resident in that top five or so and has challenged Jon Jones previously. This […]",
      "content": "UFC 261’s main card got off to a wild start with Anthony Smith and Jimmy Crute. Crute is a young, surging light-heavyweight looking to break in at the top end of the division against Smith, a man that has become a resident in that top five or so and has challenged Jon Jones previously. This is the kick from Anthony Smith that did the damageGETTY This fight got out of the first round, but that’s where it finished after Smith landed one of the most devastating leg kicks you’ll ever see. Smith was having his legs worked over early on and welts began to show around his knee. The former light-heavyweight challenger stayed behind his jab and managed the distance making it hard for his Australian foe. In the final minute of the round, Smith landed a devastating kick behind Crute’s knee that made the 25 year old crumble. His leg folded and his ankle seemed to lose all feeling. As Joe Rogan noted, he was moving like he had club foot. And despite being dropped, he still managed to score two – yes, two! – takedowns. Amazing. BIG moment in the first round! Smith lands the leg kick and Crute immediately goes to the ground! #UFC261 pic.twitter.com/XqsPNG0oKT— UFC Europe (@UFCEurope) April 25, 2021 You cannot deny this kid's toughness #UFC261 pic.twitter.com/4xv8t2xHc3— UFC (@ufc) April 25, 2021 Jimmy Crute’s foot was a mess Crute saw out the round, but he could barely walk back to his corner and he was obviously in major trouble.  He got off his stool to start the second round, but the UFC doctor took one look at him and waved the fight off. Crute’s leg was so bad that in his frustration of the fight being called and him striking the octagon pads, he fell over because he had no balance. Jimmy Crute was devastated with the resultGETTY Anthony Smith was all class in victory with Jimmy Crute After the fight, Smith embraced Crute and promised him he’d learn from this and he’d be back. While we don’t have an official diagnosis with what has gone wrong with Crute at this point, but it could be the peroneal nerve. That provides movement and sensation to the lower leg from around the knee, something Crute was clearly lacking.",
      "pubDate": "2021-04-25 05:11:20",
      "image_url": null,
      "source_id": "talksport"
    },
    {
      "title": "Rose Namajunas wins UFC title with beautiful head kick KO on Weili Zhang that left Joe Rogan crying in the octagon",
      "link": "https://talksport.com/sport/mma/871245/rose-namajunas-wins-ufc-title-beautiful-head-kick-weili-zhang-joe-rogan-crying-ufc-261/",
      "keywords": ["MMA", "Sport", "ufc"],
      "creator": ["Alex McCarthy"],
      "video_url": null,
      "description": "Rose Namajunas stunned Weili Zhang and the world to record a stunning first-round knockout in the co-main event of UFC 261. Thug Rose landed a picture-perfect head kick to drop the champion and after she rained down some unanswered strikes, the referee called the fight off. Zhang, still wobbling and visibly stunned, argued that the […]",
      "content": "Rose Namajunas stunned Weili Zhang and the world to record a stunning first-round knockout in the co-main event of UFC 261. Thug Rose landed a picture-perfect head kick to drop the champion and after she rained down some unanswered strikes, the referee called the fight off. The kick that won Rose Namajunas the titleGETTY Zhang, still wobbling and visibly stunned, argued that the fight was stopped too early and couldn’t hide her anger. Truth be told, she was just stunned by what had happened and struggled to accept her second loss of her career.Namajunas was overcome with emotion after winning the women’s strawweight strap. Her trainer told her to say she was the best after the fight and she repeatedly said “I’m the best. I’m the best.”Once Joe Rogan got in the octagon to interview the new champion, he was clearly teary eyed himself. He revealed he had heard her telling herself “I’m the best” over and over again before the fight even started. Namajunas’s corner gave her the beliefGETTY When Rogan asked her about that, she simply said: “I am the best,” with a smile.Rogan admitted to crying both in the interview and afterwards at the commentary desk. They also revealed that Thug Rose’s teammate Justin Gaethje had been in tears, too.The fight only went one minute and eighteen seconds and Zhang was unable to impose herself like she did what many believe was the greatest female MMA fight ever with Joanna Jędrzejczyk. Weili Zhang wasn’t happy with the finish, but Rose Namajunas gave her several unanswered shotsGETTY UFC 261 had one of the most insane main cards in UFC history. Alongside the Namajunas title win, Valentina Shevchenko utterly dominated Jessia Andrade in the first title fight of the night. Chris Weidman suffered a horrendous broken leg in just 17 seconds of his fight with Uriah Hall and Jimmy Crute endured a leg injury of his own after Anthony Smith kicked him into a doctor stoppage after round one.To cap things off, Kamaru Usman knocked Jorge Masvidal out in the main event to cement his place as one of the UFC’s pound-for-pound best.",
      "pubDate": "2021-04-25 05:10:12",
      "image_url": null,
      "source_id": "talksport"
    },
    {
      "title": "YEEZY and Balenciaga Collaborate on DMX Tribute Tee",
      "link": "http://feedproxy.google.com/~r/hypebeast/feed/~3/L36EQ2seikQ/",
      "keywords": ["Fashion"],
      "creator": null,
      "video_url": null,
      "description": "To mark the memorial service at the Barclays Center in Brooklyn for DMX, Balenciaga and YEEZY have come together for a tribute tee dedicated to the late rapper.In memory of DMX, the special collaborative released was designed by Demna Gvasalia helmed Balenciaga and initiated by Kanye West's YEEZY label. The retro-style long sleeve tee features an original DMX screen-printed portrait artwork on the front with \"12.18.1970\" printed on the right sleeve, \"04.09.2021\" printed on the left sleeve and \"IN LOVING MEMORY\" at the rear. The heavyweight cotton, oversized fit tee is treated with a vintage wash for a worn-in faded black look and feel.Priced at $200 USD, the Balenciaga x YEEZY DMX Tribute Tee is available now on a dedicated website with all proceeds going towards the late rapper's family.For more contemporary fashion, the Akagi RedSuns and Akina SpeedStars clash for BAIT's Initial D Drop II capsule.Click here to view full gallery at HYPEBEAST",
      "content": "To mark the memorial service at the Barclays Center in Brooklyn for DMX, Balenciaga and YEEZY have come together for a tribute tee dedicated to the late rapper.In memory of DMX, the special collaborative released was designed by Demna Gvasalia helmed Balenciaga and initiated by Kanye West's YEEZY label. The retro-style long sleeve tee features an original DMX screen-printed portrait artwork on the front with \"12.18.1970\" printed on the right sleeve, \"04.09.2021\" printed on the left sleeve and \"IN LOVING MEMORY\" at the rear. The heavyweight cotton, oversized fit tee is treated with a vintage wash for a worn-in faded black look and feel.Priced at $200 USD, the Balenciaga x YEEZY DMX Tribute Tee is available now on a dedicated website with all proceeds going towards the late rapper's family.For more contemporary fashion, the Akagi RedSuns and Akina SpeedStars clash for BAIT's Initial D Drop II capsule.Click here to view full gallery at HYPEBEAST",
      "pubDate": "2021-04-25 05:10:02",
      "image_url": null,
      "source_id": "hypebeast"
    }
  ],
  "nextPage": 1
}
